package info_gallery;
//Класс файналов по информации про Ан -225
public class ArrAn {
	// Ан-225
	static final String[] HISTORY_AN225 = {
			"		Причиной постройки Ан-225 была необходимость создания авиационной транспортной системы для проекта многоразового космического корабля «Буран». Основным назначением тяжёлого транспортного самолёта в рамках данного проекта была перевозка различных компонентов ракеты-носителя и космического корабля от места производства и сборки к месту старта. Также существовала важная задача доставки космического челнока на космодром в случае приземления его на запасных аэродромах.",
			"		Кроме того, предполагалось использование Ан-225 в качестве первой ступени системы воздушного старта космического корабля, что требовало от самолёта грузоподъёмности не менее 250 тонн.",
			"		Так как блоки ракеты-носителя «Энергия» и сам «Буран» имели габариты, превышающие размеры грузового отсека Ан-225, на самолёте предусматривалось крепление наружных грузов. Наличие спутной струи от закреплённого наверху фюзеляжа крупногабаритного груза потребовало заменить хвостовое оперение Ан-124 двухкилевым, чтобы избежать его аэродинамического затенения.",
			"		Таким образом, Ан-225 создавался как самолёт, предназначенный для решения узкого круга достаточно уникальных транспортных задач, но использование Ан-124 в качестве основы дало ему определённые качества универсального транспортного самолёта.",
			"		Часто ошибочно указывают П. В. Балабуева главным конструктором. Балабуев являлся генеральным конструктором всего КБ в 1984—2005 годах. А главным конструктором — руководителем проекта — указом Совмина СССР был назначен В. �?. Толмачев." };
	static final String[] FUNCTION_AN225 = {
			"		Самолёт имеет возможность:",
			" - перевозки грузов широкого назначения (крупногабаритных, тяжёлых, длинномерных) общим весом до 250 т;",
			" - внутриконтинентальной беспосадочной перевозки грузов весом 180—200 т;",
			" - межконтинентальной перевозки грузов весом до 150 т;",
			" - перевозки тяжёлых крупногабаритных моногрузов весом до 200 т снаружи на фюзеляже;",
			" - самолёт является базой для создания авиационно-космических систем (проект).",
			"		Самолёт обладает вместительной грузовой кабиной, которая позволяет перевозить внутри фюзеляжа различные грузы, например:",
			" - 16 десятитонных универсальных авиационных контейнеров УАК-10;",
			" - 50 легковых автомобилей;",
			" - моногрузы весом до 200 т (турбины, генераторы, автосамосвалы «БелАЗ», «Комацу», «Юклид» и т. п.)." };
	static final String[] TT_AN225 = {
			"		Ан-225 представляет собой шестимоторный турбореактивный высокоплан со стреловидным крылом и двухкилевым оперением. Оборудован шестью авиадвигателями Д-18Т производства ОАО «Мотор Сич» разработки ЗМКБ «Прогресс» им. академика А. Г. �?вченко.",
			"		Размеры грузовой кабины: длина — 43 м, ширина — 6,4 м, высота — 4,4 м. Грузовая кабина самолёта герметична, что значительно расширяет его транспортные возможности. Над грузовой кабиной на 2-ой палубе — кабина для шести человек сменного экипажа и 88 человек, сопровождающих груз.",
			"		Бортовой комплекс погрузочного оборудования, а также конструкция переднего грузового люка с рампой обеспечивают быстрое и удобное проведение погрузочно-разгрузочных работ. Самолёт способен перевозить уникальные грузы на фюзеляже, габариты которых не позволяют разместить их на других наземных и воздушных транспортных средствах. Для установки этих грузов на фюзеляже имеется специальная система крепления.",
			"		Самолёт Ан-225 «Мрия» имеет большую степень преемственности и унификации по системам, агрегатам, узлам и деталям планёра, силовой установки и оборудования с сертифицированным самолётом Ан-124-100 («Руслан»).",
			"		Основные отличия от Ан-124: новый центроплан, увеличение длины фюзеляжа за счёт вставок, замена хвостового оперения на двухкилевое, отсутствие хвостового грузового люка, увеличение количества стоек основного шасси, система крепления и наддува наружных грузов, два дополнительных двигателя",
			"		Лётно-технические характеристики: Экипаж, чел: 7",
			"Размах крыла, м: 88,4",
			"Длина, м: 84",
			"Высота, м: 18,2",
			"Площадь крыла, м²: 905",
			"Масса:пустого самолёта, кг: 250 000,максимальная взлётная, кг: 640 000",
			"Тяга нефорсажная, кH: 1377",
			"Масса топлива, нормальная, кг: 300 000",
			"Крейсерская скорость, км/ч: 850",
			"Дальность полёта:практическая, км: 15 400, практическая с максимальной нагрузкой, км: 4 500",
			"Практический потолок, м: 11 000",
			"Полезная нагрузка, кг: дo 250 000",
			"Двигатель: Тип двигателя:Турбореактивный двухконтурный",
			"Модель: «Д-18Т»",
			"Тяга:взлётный режим, кгс: 6 × 23 430,крейсерский режим, кгс: 6 × 4 860",
			"Масса двигателя, кг: 6 × 4 100",
			"Удельный расход топлива (крейсерский режим), кг/кгс·ч: 0,57-0,63",
			"Удельный расход топлива (взлётный режим), кг/кгс·ч: 0,34",
			"Межремонтный ресурс, ч: 6 000",
			"Габариты:длина, мм: 5 400,диаметр, мм: 2 330",
			"		Все системы управления резервированы четырёхкратно.В остальном Ан-225 практически полностью соответствует самолёту Ан-124, что существенно облегчило и удешевило как его создание, так и эксплуатацию." };
	static final String[] EXPLUATATION_AN225 = {
			"		Впервые поднялся в небо 21 декабря 1988 года.",
			"		При том, что самолёт создавался в СССР для перевозки компонентов ракет-носителей «Энергия» и космического корабля «Буран», к моменту окончания строительства первого Ан-225 все необходимые перевозки были сделаны самолётом ВМ-Т «Атлант», и в программе «Буран» Ан-225 поучаствовал, только перевезя «Буран» на Парижский авиасалон в мае 1989 года и совершив несколько показательных полётов на Байконуре в апреле 1991 года.",
			"		В настоящее время",
			"		После распада СССР единственный летающий экземпляр самолёта в 1994 году прекратил полёты, с него были сняты двигатели и другое оборудование для использования в «Русланах». Однако к 2000-м годам потребность в нём стала очевидной, и его восстановили силами украинских предприятий. Также авиалайнер подвергся доработке, чтобы соответствовать стандартам самолётов для гражданской авиации.",
			"		23 мая 2001 года были выданы сертификаты типа на Ан-225 «Мрия» Авиационным регистром Межгосударственного авиационного комитета (АР МАК) и Государственным департаментом авиационного транспорта Украины («Укравиатранс»), что позволило начать коммерческое использование самолёта в качестве перевозчика грузов.",
			"		В настоящее время Ан-225 выполняет коммерческие грузовые перевозки в составе авиатранспортного подразделения АНТК им. О. К. Антонова — авиакомпания «Antonov Airlines». Также проводятся проектные работы по использованию самолёта в качестве летающего стартового комплекса для авиационно-космических систем. Один из перспективных проектов — российско-украинская многоцелевая авиационно-космическая система (МАКС)." };
	static final String[] RECORDS_AN225 = {
			"		Ан-225 является самым тяжёлым грузоподъёмным самолётом, когда-либо поднимавшимся в воздух. Единственный самолёт, превосходящий Ан-225 по размаху крыла, это Hughes H-4 Hercules, который относится к классу летающих лодок и поднимался в воздух всего один раз в 1947 году.",
			"		Самолёт «Мрия» установил мировой рекорд взлётного веса и грузоподъёмности. 22 марта 1989 года Ан-225 совершил полёт с грузом 156,3 тонны, в котором было одновременно побито 110 мировых авиационных рекордов. Такое достижение — рекорд само по себе. В общей сложности данный самолёт — обладатель около 250 мировых рекордов.",
			"		В августе 2004 года был поставлен рекорд — «Мрия» перевезла 250 тонн спецтехники по заказу компании Zeromax GmbH из Праги в Ташкент с промежуточной посадкой в Самаре.",
			"		В августе 2009 года самолёт был занесён в Книгу рекордов Гиннесса за перевозку самого большого в истории авиации моногруза общим весом в 187,6 тонны. Это был генератор весом в 174 тонны, который транспортировался вместе со специальной рамой из немецкого Франкфурта в Ереван для новой армянской электростанции.",
			"		«Мрия» — рекордсмен по весу перевозимого груза: коммерческого — 247 тонн, коммерческого моногруза — 187,6 тонны, и абсолютный рекорд грузоподъёмности — 253,8 тонны.",
			"		10 июня 2010 года перевезён самый длинномерный груз в истории воздушных транспортировок — две лопасти ветряка длиной 42,1 м каждая." };
	static final String[] SECOND_AN225 = {
			"		Второй экземпляр самолёта планировалось достроить на заводе «Антонов» при наличии финансирования. Ещё с советских времён остались центроплан, фюзеляж и крыло. Эта машина может быть достроена, если появится заказчик.",
			"		В 2006 году генеральный директор Киевского завода «Авиант» Олег Шевченко говорил что, для завершения постройки самолёта Ан-225, необходима сумма, приблизительно равная 90 млн долл. США; вместе с проведением испытаний самолёта сумма составила бы 120 млн долл." };
	// АН-124
	static final String[] HISTORY_AN124 = {
			"		Самолёт Ан-124 «Руслан» создавался в первую очередь для воздушной транспортировки мобильных пусковых установок межконтинентальных баллистических ракет, таких как тягач МЗКТ-79221, а также для проведения крупномасштабных десантных воздушных перевозок личного состава и тяжёлой боевой техники. Также самолёт предназначался и для крупнотоннажных перевозок в интересах народного хозяйства. Гражданский вариант самолёта может выполнять полёты на всех географических широтах и предназначен для перевозки грузов, в том числе нестандартных крупногабаритных.",
			"		Первый полёт опытный образец самолёта совершил 24 декабря 1982 года в Киеве. На вооружение военно-транспортной авиации СССР самолёт поступил в январе 1987 года, всего было построено 56 машин.",
			"		Главным конструктором самолёта часто ошибочно указывают П. В. Балабуева. Балабуев в 1984—2005 годах являлся генеральным конструктором всего КБ. А главным конструктором — руководителем проекта по самолётам Ан-124 и Ан-225 — указом СОВМ�?На СССР был назначен В. �?. Толмачев.",
			"		В конце февраля 2006 года в рамках программы модернизации и возобновления серийного производства самолётов Ан-124-100 на ульяновском предприятии «Авиастар» было решено открыть филиал АНТК им. Антонова. Однако спустя два месяца проект возобновления серийного производства был признан бесперспективным." };
	static final String[] SERIES_AN124 = {
			"		В октябре 2006 года Комитет по вопросам экономического сотрудничества украинско-российской комиссии Ющенко — Путин принял решение продолжить реализацию проекта самолёта Ан-124, имея в виду возможное возобновление серийного производства. В августе 2007 года подписано соглашение о возобновлении серийного производства. Объявлено, что компания «Волга-Днепр» планирует до 2030 года приобрести до 100 модернизированных Ан-124-100М-150. Поставка двух первых машин планировалась на 2013 год.",
			"		В июне 2008 года Объединённая авиастроительная корпорация (ОАК) и Ernst & Young завершили подготовку бизнес-плана проекта по возобновлению производства самолётов Ан-124 «Руслан». В соответствии с этим документом для начала производства самолёта потребуется получить подтверждённые заказы не менее чем на 40 машин. Как заявил член правления ОАК Виктор Ливанов, «сегодня спрос на самолёты есть, до 2030 года авиакомпаниям понадобится 71 лайнер». В случае набора достаточного количества заказов самолёты будут производиться на ульяновском «Авиастаре» с 2012 года по одному-два лайнера в год. Также есть два недостроенных планёра, которые будут достроены. В ближайшее время ожидается выведение из распоряжения Министерства обороны пяти машин. Стоимость нового Ан-124 на то время составляла 150—160 млн долларов США.",
			"		Заказы на машины поступили со стороны Министерства обороны (3 самолёта) и авиакомпании Волга-Днепр (40 самолётов).",
			"		Объём рынка оценивается в 82 машины. В настоящее время есть опционы на 61 самолёт, 52 из них намерена приобрести Россия. Среди возможных заказчиков называли Объединённые Арабские Эмираты и Кувейт. 29 сентября президент Дмитрий Кива заявлял, что предприятие совместно с «U.S. Aerospace» допустили к участию в тендере Минобороны США на поставку самолётов-топливозаправщиков, общая сумма которого составляет $50 млрд. КБ «Антонов» представил на тендере три различные модели самолётов: Ан-124-KC, Ан-122-KC и Ан-112-KC. Тендер состоялся и КБ «Антонов» выбыло в первом туре.",
			"		20 июля 2011 года председатель Совета директоров ОАО «Мотор Сич» Вячеслав Богуслаев сообщил, что программа восстановления производства самолёта Ан-124 «Руслан» на ульяновском авиазаводе «Авиастар-СП» отодвинута на 2016 год.",
			"		17 июля 2013 года Россия и Украина достигли договоренности о создании совместного предприятия (СП) по производству самолёта Ан-124-100.",
			"		В конце июля 2013 года появилась информация о том, что на заводе «Авиастар-СП» начата работа по возобновлению производства Ан-124.",
			"		В начале августа 2013 года командующий ВДВ Владимир Шаманов заявил о необходимости иметь на вооружении ВДВ такие самолёты, как Ан-124. Он также напомнил, что постройка Ан-124 уже начата в Ульяновске." };
	static final String[] Construction_AN124 = {
			"		Самолёт построен по аэродинамической схеме турбореактивного четырёхмоторного высокоплана со стреловидным крылом и однокилевым оперением оснащён авиадвигателями Д-18Т производства ОАО «Мотор Сич». �?меет две палубы: нижняя палуба — грузовая кабина; верхняя палуба — кабина экипажа, кабина сменного экипажа, кабина сопровождающих до 21 чел. Общий объём грузовой кабины составляет 1050м³.",
			"		Многостоечное шасси, снабжённое 24 колёсами, позволяет использовать самолёт с грунтовых взлётно-посадочных полос, а также изменять стояночный клиренс и угол наклона фюзеляжа, что облегчает проведение погрузочно-разгрузочных работ.",
			"		Комплекс десантно-транспортного оборудования, бортовая система автоматизированного контроля технического состояния систем и оборудования на 1000 точек, две вспомогательные силовые установки с электрогенераторами и турбонасосами обеспечивают автономность эксплуатации. Особенностью конструкции самолёта является наличие двух грузовых люков в носовой и в хвостовой части фюзеляжа, что облегчает и ускоряет процессы загрузки и выгрузки грузов.",
			"		Грузовой отсек герметичен. Над ним находится кабина экипажа, отсек для отдыха экипажа и пассажирская кабина для сопровождающих. Бортовое оборудование предназначено для выполнения транспортно-десантных задач днём и ночью, в простых и сложных метеоусловиях, при противодействии ПВО противника, длительном отрыве от аэродрома основного базирования и включает: прицельно-навигационный пилотажный комплекс, типовой комплекс связи, десантно-транспортное оборудование (допускается десантирование только посадочным методом). Самолёт Ан-124 состоит на вооружении ВВС России, но используется для обслуживания задач блока НАТО. Для военных перевозок самолёт применяется для обеспечения частей НАТО в районах Средней Азии и Афганистане и в районе Персидского залива (для перевозки зенитно-ракетного комплекса «Пэтриот»).",
			"		Самолёт оснащён погрузочно-разгрузочным оборудованием, бортовыми передвижными кранами (БПК) общей грузоподъёмностью до 20 тонн, швартовочным оборудованием. Без специального разрешения допускается перевозить моногрузы весом до 50 тонн. Самолёт имеет систему централизованной заправки под давлением через четыре заправочные горловины, расположенные в левой и правой гондолах главных стоек шасси. Также, возможна заправка самотёком через две заливные горловины, расположенные на верхних частях правой и левой консолей крыла.",
			"		Ан-124 способен брать на борт до 440 парашютистов-десантников или 880 солдат с полным снаряжением. Однако начатые в 1989 году опыты по сбросу с самолёта манекенов парашютистов заставили ввести ограничения на парашютное десантирование людей, обусловленные аэродинамическими факторами." };
}
